In [2]:
import pandas as pd
import numpy as np

In [29]:
df = pd.read_csv("student5.csv")
df

   roll     name class  marks  age
0     1   surbhi    TE  67.44   23
1     2    sujay    TE  74.12   22
2     3  subhash    BE  82.44   21
3     4   sachin    TE  59.33   21
4     5  shalini    TE  63.45   20

In [43]:
df.iloc[1, 2], [0, 1]

('TE', [0, 1])

In [30]:
# sorting

df.sort_values(by = "class")

   roll     name class  marks  age
2     3  subhash    BE  82.44   21
0     1   surbhi    TE  67.44   23
1     2    sujay    TE  74.12   22
3     4   sachin    TE  59.33   21
4     5  shalini    TE  63.45   20

In [31]:
df.sort_values (by = ['class', 'marks'], ascending = False)

   roll     name class  marks  age
1     2    sujay    TE  74.12   22
0     1   surbhi    TE  67.44   23
4     5  shalini    TE  63.45   20
3     4   sachin    TE  59.33   21
2     3  subhash    BE  82.44   21

In [32]:
df['marks']

0    67.44
1    74.12
2    82.44
3    59.33
4    63.45
Name: marks, dtype: float64

In [37]:
type(df['marks'])

pandas.core.series.Series

In [33]:
type(df[['marks', 'name']])

pandas.core.frame.DataFrame

In [ ]:
## methods on series

In [34]:
df['marks'].max()

82.44

In [35]:
df['marks'].std()

9.123586465858699

In [39]:
df['marks'].mean()

69.356

In [44]:
df['class'].mode()

0    TE
Name: class, dtype: object

In [47]:
df['name'].str.title()

0     Surbhi
1      Sujay
2    Subhash
3     Sachin
4    Shalini
Name: name, dtype: object

In [48]:
df['name'].str.startswith('an')

0    False
1    False
2    False
3    False
4    False
Name: name, dtype: bool

In [50]:
df['name'].str.contains('i')

0     True
1    False
2    False
3     True
4     True
Name: name, dtype: bool

In [ ]:
# add or modify

In [51]:
df

   roll     name class  marks  age
0     1   surbhi    TE  67.44   23
1     2    sujay    TE  74.12   22
2     3  subhash    BE  82.44   21
3     4   sachin    TE  59.33   21
4     5  shalini    TE  63.45   20

In [54]:
df['roll'] = df['roll'] + 100
df

   roll     name class  marks  age
0   301   surbhi    TE  67.44   23
1   302    sujay    TE  74.12   22
2   303  subhash    BE  82.44   21
3   304   sachin    TE  59.33   21
4   305  shalini    TE  63.45   20

In [68]:
gender = ['male', 'male', 'male', 'female', 'female']

In [69]:
df['gender'] = gender

In [70]:
df

   roll     name class  marks  age  gender   cgpa
0   301   surbhi    TE  67.44   23    male  7.244
1   302    sujay    TE  74.12   22    male  7.912
2   303  subhash    BE  82.44   21    male  8.744
3   304   sachin    TE  59.33   21  female  6.433
4   305  shalini    TE  63.45   20  female  6.845

In [71]:
# create a 'cgpa' column => values will marks/10 + 0.5

In [72]:
df['cgpa'] = df['marks'] / 10 + 0.5

In [73]:
df

   roll     name class  marks  age  gender   cgpa
0   301   surbhi    TE  67.44   23    male  7.244
1   302    sujay    TE  74.12   22    male  7.912
2   303  subhash    BE  82.44   21    male  8.744
3   304   sachin    TE  59.33   21  female  6.433
4   305  shalini    TE  63.45   20  female  6.845

In [74]:
df['gender'].value_counts()

gender
male      3
female    2
Name: count, dtype: int64

### group by operation

In [76]:
gr = df.groupby('class')

In [77]:
gr.groups

{'BE': [2], 'TE': [0, 1, 3, 4]}

In [78]:
gr.get_group('BE')

   roll     name class  marks  age gender   cgpa
2   303  subhash    BE  82.44   21   male  8.744

In [79]:
gr.get_group('TE')

   roll     name class  marks  age  gender   cgpa
0   301   surbhi    TE  67.44   23    male  7.244
1   302    sujay    TE  74.12   22    male  7.912
3   304   sachin    TE  59.33   21  female  6.433
4   305  shalini    TE  63.45   20  female  6.845

In [80]:
gr['marks'].mean()

class
BE    82.440
TE    66.085
Name: marks, dtype: float64

In [81]:
gr['cgpa'].max()

class
BE    8.744
TE    7.912
Name: cgpa, dtype: float64

In [ ]:
# delete cgpa and gender column

In [89]:
df.drop(['gender', 'cgpa'], axis = 1)

   roll     name class  marks  age
0   301   surbhi    TE  67.44   23
1   302    sujay    TE  74.12   22
2   303  subhash    BE  82.44   21
3   304   sachin    TE  59.33   21
4   305  shalini    TE  63.45   20

In [ ]:
# create a dataframe -> 'newdf'
# columns -> roll, gender, cgpa
# roll column values should be same as 'df'

In [115]:
cgpa = df['marks'] / 10 + 0.5

In [116]:
newdf = df[['roll', 'gender', 'cgpa']].copy()
print(newdf.head())

   roll  gender   cgpa
0   301    male  7.244
1   302    male  7.912
2   303    male  8.744
3   304  female  6.433
4   305  female  6.845

In [117]:
df.columns

Index(['roll', 'name', 'class', 'marks', 'age', 'gender', 'cgpa'], dtype='object')

In [118]:
newdf.columns

Index(['roll', 'gender', 'cgpa'], dtype='object')

In [119]:
# merge

In [120]:
pd.merge(df, newdf, on = 'roll')

   roll     name class  marks  age gender_x  cgpa_x gender_y  cgpa_y
0   301   surbhi    TE  67.44   23     male   7.244     male   7.244
1   302    sujay    TE  74.12   22     male   7.912     male   7.912
2   303  subhash    BE  82.44   21     male   8.744     male   8.744
3   304   sachin    TE  59.33   21   female   6.433   female   6.433
4   305  shalini    TE  63.45   20   female   6.845   female   6.845

### load students5.csv

In [124]:
n = pd.read_csv("student2.csv")
n

   roll     name class  marks   age
0     1     anil    TE  56.77  22.0
1     2     amit    TE  59.77  21.0
2     3   aniket    BE  76.88  19.0
3     4  ajinkya    TE  69.66   NaN
4     5     asha   NaN  63.28  20.0
5     6   ayesha    BE  49.55  20.0
6     7     amar    BE    NaN  19.0
7     8    amita    BE    NaN  23.0
8     9     amol    TE  56.75  20.0
9    10    anmol    BE  78.66  21.0

In [127]:
df['roll'] = df['roll'] + 100

In [129]:
df

   roll     name class  marks  age
0   101   surbhi    TE  67.44   23
1   102    sujay    TE  74.12   22
2   103  subhash    BE  82.44   21
3   104   sachin    TE  59.33   21
4   105  shalini    TE  63.45   20

In [130]:
pd.concat([n, df])

   roll     name class  marks   age
0     1     anil    TE  56.77  22.0
1     2     amit    TE  59.77  21.0
2     3   aniket    BE  76.88  19.0
3     4  ajinkya    TE  69.66   NaN
4     5     asha   NaN  63.28  20.0
5     6   ayesha    BE  49.55  20.0
6     7     amar    BE    NaN  19.0
7     8    amita    BE    NaN  23.0
8     9     amol    TE  56.75  20.0
9    10    anmol    BE  78.66  21.0
0   101   surbhi    TE  67.44  23.0
1   102    sujay    TE  74.12  22.0
2   103  subhash    BE  82.44  21.0
3   104   sachin    TE  59.33  21.0
4   105  shalini    TE  63.45  20.0

In [131]:
pd.concat([n, df], ignore_index = True)

    roll     name class  marks   age
0      1     anil    TE  56.77  22.0
1      2     amit    TE  59.77  21.0
2      3   aniket    BE  76.88  19.0
3      4  ajinkya    TE  69.66   NaN
4      5     asha   NaN  63.28  20.0
5      6   ayesha    BE  49.55  20.0
6      7     amar    BE    NaN  19.0
7      8    amita    BE    NaN  23.0
8      9     amol    TE  56.75  20.0
9     10    anmol    BE  78.66  21.0
10   101   surbhi    TE  67.44  23.0
11   102    sujay    TE  74.12  22.0
12   103  subhash    BE  82.44  21.0
13   104   sachin    TE  59.33  21.0
14   105  shalini    TE  63.45  20.0

In [132]:
df

   roll     name class  marks  age
0   101   surbhi    TE  67.44   23
1   102    sujay    TE  74.12   22
2   103  subhash    BE  82.44   21
3   104   sachin    TE  59.33   21
4   105  shalini    TE  63.45   20

In [133]:
df['marks'] > 60

0     True
1     True
2     True
3    False
4     True
Name: marks, dtype: bool

In [153]:
df[df['marks'] > 60]

   roll     name class  marks  age
0   101   surbhi    TE  67.44   23
1   102    sujay    TE  74.12   22
2   103  subhash    BE  82.44   21
4   105  shalini    TE  63.45   20

In [154]:
# > 60 and BE

In [156]:
df[(df['marks'] > 60) & (df['class'] == 'BE')]

   roll     name class  marks  age
2   103  subhash    BE  82.44   21

In [ ]:
# age = 21, name => start with 'an'

In [161]:
df[(df['age'] == 21) & (df['name'].str.startswith('an'))]

Empty DataFrame
Columns: [roll, name, class, marks, age]
Index: []

In [ ]:
x = df[(df['marks'] > 60) & (df['class'] == 'BE')]

In [ ]:
x.to_csv("op.csv", index = False)

In [167]:
# 1.Create a Series  of 5 numbers and assign custom labels


import pandas as pd

data = [10, 20, 30, 40, 50]
labels = ['a', 'b', 'c', 'd', 'e']

series = pd.Series(data, index=labels)

print(series)

a    10
b    20
c    30
d    40
e    50
dtype: int64

In [6]:
# 2.Construct a DataFrame from a dictionary with student names, marks, and cities 

import pandas as pd
import numpy as np

students = {
    'Name': ['palak', 'Tanushree', 'kalyani', 'mohini', 'siddhi'],
    'Marks': [80, 90, 75, 85, 95],
    'City': ['Mumbai', 'Moshi', 'London', 'Paris', 'Pune']
}
df = pd.DataFrame(students)

In [7]:
df

        Name  Marks    City
0      palak     80  Mumbai
1  Tanushree     90   Moshi
2    kalyani     75  London
3     mohini     85   Paris
4     siddhi     95    Pune

In [2]:
# 3.Create a DataFrame from a numpy  array and assign column from names

import numpy as np
import pandas as pd

arr = np.array([
    [10, 85.5, 1],
    [20, 92.0, 2],
    [30, 78.3, 3],
    [40, 88.7, 4],
    [50, 69.2, 5]
])

df = pd.DataFrame(arr, columns=['Math', 'Science', 'English'])
df

   Math  Science  English
0  10.0     85.5      1.0
1  20.0     92.0      2.0
2  30.0     78.3      3.0
3  40.0     88.7      4.0
4  50.0     69.2      5.0

In [3]:
##5

h = df.head(2)
print('head \n',h)
t = df.tail()
print('tail \n',t)
i = df.info
print('info \n',i)
d = df.describe
print('describe \n',d)

head
    Math  Science  English
0  10.0     85.5      1.0
1  20.0     92.0      2.0
tail
    Math  Science  English
0  10.0     85.5      1.0
1  20.0     92.0      2.0
2  30.0     78.3      3.0
3  40.0     88.7      4.0
4  50.0     69.2      5.0
info
 <bound method DataFrame.info of    Math  Science  English
0  10.0     85.5      1.0
1  20.0     92.0      2.0
2  30.0     78.3      3.0
3  40.0     88.7      4.0
4  50.0     69.2      5.0>
describe
 <bound method NDFrame.describe of    Math  Science  English
0  10.0     85.5      1.0
1  20.0     92.0      2.0
2  30.0     78.3      3.0
3  40.0     88.7      4.0
4  50.0     69.2      5.0>

In [4]:
##6

dp = pd.DataFrame({
    'name': ['Anil', 'Asha', 'Amit', 'Amol', 'Ayesha'],
    'marks': [85, 78, 92, 67, 74],
    'cities': ['Mumbai', 'Pune', 'Delhi', 'Nashik', 'Nagpur']
})

sorted_data = dp.sort_values(by =['marks'])
print("sorted data :\n",sorted_data)

sorted data :
      name  marks  cities
3    Amol     67  Nashik
4  Ayesha     74  Nagpur
1    Asha     78    Pune
0    Anil     85  Mumbai
2    Amit     92   Delhi